package com.zkdp.nlp.hadoopner;
import java.io.FileNotFoundException;

public class test{
	public static void main(String[] args) throws FileNotFoundException {
//		System.out.println( System.getProperty("os.name") ); 
//		String urls ="1505725513&1505725513@hrefhttps://blog.cnlinfo.net/17859123_681952.htmendLxQ";
//		String url =urls.substring(urls.indexOf("http"), urls.indexOf("end"));
//		System.out.println(url);
		
//		String res="【 环球网 特约 记者 <PERSON>徐步文</PERSON> 】 <MISC>月日 至 月日</MISC> ， 全 国 爆炸 物品 安全 监管 业务 骨干 培训班 在 <ORG>浙江 省委</ORG> 党校 举办 。 <ORG>东阳市 公安局</ORG> 领导 在 会 上 向 全 国 同行 介绍 了 首 创 的 影视 烟火 道具 枪支 安全 监管 上 的 新 模式 。 横 店 影视 产业 蓬勃 发展 ， 已 成为 <GPE>浙江省 东阳市</GPE> 的 支柱性 产业 。 剧组 拍摄 战争 题材 的 影视 作品 ， 使用 道具 枪支 不 可 缺少 ， 并 呈现 “ 爆发 ” 势头 。 据 统计 ， 年 横 店 影视城 道具 枪支 ， 年 支 ， 年 道具 枪 达支 ， <MISC>年 截至 月日</MISC> ， 已 达 支 。 影视 产业 是 新兴 产业 ， 同样 道具 枪支 安全 监管 也 是 地方 公安 机关 的 新 课题 ， 没有 现成 的 经验 可 供 ���鉴 。 如何 规范 管理 ？ 确保 拍摄 影视 剧组 的 道具 用 枪 “ 不 流失 、 不 打响 ” ， <ORG>东阳市 公安局</ORG> 深入 调查 研究 ， 反复 推敲 细化 ， 首 创 道具 枪支 全方位 安全 管理 新 模式 为 全 国 公安 机关 提供 了 范本 。 景区 剧组 扎堆 道具 用 枪 频繁 出现 影视 剧组 的 道具 枪支 虽然 已经 过 处理 ， 但 只要 内行人 简单 修复 就 能 恢复 真枪 性能 ， 万一 保管 不慎 ， 流失 社会 ， 后果 难 料 ， 必须 从严 从紧 管理 。 普通 市民 平常 接触 到 枪支 机会 少 ， 但 随着 横 店 影视 <PERSON>陈</PERSON> 的 蓬勃 兴起 ， 剧组 扎堆 ， 道具 用枪 在 拍摄 现场 频繁 大量 出现 。 <ORG>东阳市 公安局 治安 管理 中心 治安 大队</ORG> 、 <ORG>横店 分局</ORG> 派出所 在 日常 管理 中 ， 发现 了 这个 隐患 。 局 党委 高度 重视 ， 专门 进行 调研 ， 发现 存在 如下 问题 ： 从业 队伍 素质 参差不齐 ， 除 主要 演员 外 ， 剧组 还 要 雇用 大量 的 临时性 群众 演员 ， 鱼龙 混杂 没有 集中 统一 的 保管 场所 ， 由 各 剧组 分散 管理 ， 监管 难 ��� 到位 ， 管理 安全 风险 大 剧组 领用 归还 不 规范 。 坚决 清除 监管 一阵风 应 对 取巧 心理 如何 把 安全 措施 全方位 落实 到位 ？ 年 以来 ， <GPE>东阳市</GPE> 公安局 历经 规章 制度 的 建立 ， 修订 完善 ， 硬件 建设 等 环节 ， 年底 推出 全 国 <MISC>首</MISC> 个 《 影视 道具 效果 枪支 弹药 安全 管理 规范 》 ， 以 “ 可 执行 、 可 监督 、 可 检查 、 可 问 责 ” 为 基础 建章立制 ， 坚决 清除 监管 “ 一 阵 风 ” 的 应对 取巧 心理 “ 道具 枪支 ” 全方位 安全 管理 模式 基本 成型 ， 打造 成型 出色 管理 剧组 用 枪 的 剧本 。 明确 凡是 在 横店 影视 基地 范围 内 使用 的 道具 枪支 ， 必须 做到 “ 全程 受控 流转 、 底数 清 、 情况 明 ” 。 事前 “ 申请 报备 、 运输 许可 ” ， 到货 “ 送达 查验 、 签订 责任书 ” ， 日常 管理 “ 专库 存放 、 小时 值守 、 当班 清退 ” ， 环环相扣 ， 围绕 “ 定点 、 定量 、 受控 ” 的 封闭式 管理圈 ， 严防 流失 和 意外 打响 。 同时 ， 由 “ 影视城 警校 ” 定 �� 深入 剧组 宣传 培训 ， 由 专管 民警 每 天 在 剧组 现场 督促 ， 落实 安全 教育 、 法制 教育 和 岗位 技术 培训 ， 严格 落实 安全 管理 责任 ， 确保 各 剧组 安全 有序 的 拍摄 。 打造 安全 一 座 库 集中 储存 定 标准 <ORG>东阳市 公安局</ORG> 根据 “ 危险 物品 ” 储存 仓库 的 特殊 要求 ， 影视 拍摄 道具 枪支 “ 专用 仓库 ” 于 年月份 正式 投入 使用 ， 实现 影视 道具 用 枪 集中 管理 精细化 监管 。 专用 仓库 <MISC>三</MISC> 面 环山 ， 四周 距 民用 建筑 、 单位 建筑 米 以上 。 专用 仓库 四周 围墙 高 米 ， 围墙 外围 防火 带宽 米 ， 有效 的 把 专用 仓库 与 外围 山林 隔断 ， 满足 防火 、 防水 、 防 误入 的 安全 功能 。 整个 仓库 占地 面积 约 亩 ， 分设 门卫 、 特效 烟花 爆竹 仓库 、 影视 烟火 制品 仓库 、 道具 枪支 弹药 仓库 、 消防 储水池 。 仓库 建设 按 国标 一 级 风险 等 级 进行 单层 设计 建造 。 严格 按照 “ 人防 、 物防 、 技防 ” 有机 结合 ， 每 间 库房 安装 CK 报警器 和 视频 ��� 控 系统 ， 确保 对 专用 仓库 多 层面 实时 网 上 监管 。 库 房门 执行 双 人 双 锁 管理 ， 库房 内 防爆 、 防潮 排 风口 开 在 库房 顶部 墙体 ， 设置 有 专用 防护网 ， 能 有效 规避 鸟类 及 杂物 侵入 库房 内 的 可能 。 从 道具 用 枪 入库 、 保管 、 盘存 、 出库 着手 ， 高 标准 制定 仓库 管理 制度 ， 岗位 职责 、 操作 规程 、 应急 预案 等 上 墙 公示 ， 确保 各 项 工作 有章可循 。 严 把 入库 登记关 、 严 把 值守 保管 关 、 严 把 出库 审批 关 。 环环相扣 一 张 网内 控 外监 除 隐患 <ORG>东阳市 公安局</ORG> 在 日常 监管 工作 中 ， 严格 按 《 规范 》 执行 操作 ， 并 经常性 通过 联查 、 抽查 、 督查 等 方式 ， 及时 发现 存在 的 问题 ， 将 安全 隐患 消除 在 萌芽 状态 。 按照 “ 谁 主管 谁 负责 ， 谁 审批 谁 负责 ， 谁 使用 谁 负责 ， 谁 出事 追究 谁 责任 ” 的 原则 ， 明确 剧组 制片 主任 <MISC>负 第一</MISC> 责任 ， 枪械 师负 直接 责任 ， 确保 枪 不 离 人 ， 随时 清点 无 误 。 运送 到 横店 枪支 ， 经 派出所 ��� 管 民警 清点 检查 完好 后 ， 方 可 送入 专用 库存放 ， 仓库 凭 枪支 使用 批文 交付 当班 使用 枪支 ， <MISC>当天</MISC> 领用 当班 清退 回库 。 剧组 使用 枪支 情况 ， 提前 一 天 报 <ORG>横店 派出所</ORG> 专管员 ， “ 四定 一 网 ” 全程 监控 模式 确保 枪支 弹药 万无一失 ， 即 ： 由 特定 的 车辆 、 特定 押运 人员 、 特定 的 驾驶员 按照 特定 的 路线 运送 指定 拍摄 现场 利用 横店 社会 治安 综合 防控 “ 天网 ” 工程 实时 全程 跟踪 监管 ， 一旦 发现 问题 苗头 ， <MISC>第一</MISC> 时间 赶赴 现场 控制 解决 。 <MISC>近 些 年</MISC> ， <MISC>东阳市 六 石</MISC> 街道 、 城东 街道 、 <GPE>佐村</GPE> 、 <GPE>南马</GPE> 、 <GPE>画水镇</GPE> 等 地 ， 相继 开发 出 拍摄 场地 ， 不时 有 剧组 前来 拍摄 。 <ORG>东阳市 公安局</ORG> 深入 实践 “ 最 多 跑 <MISC>一</MISC> 次 ” 理念 ， 以 更 有力 的 新 举措 ， 做好 监管 、 服务 ， 将 道具 用 枪 监管 从 横店 向 全 市 铺开 ， 各 派出所 民警 进驻 拍摄 现场 ， 全面 实地 掌握 道具 枪支 使用 、 去向 ， 以及 空包弹 消耗 情况 配备 金属 探测仪 ， 不定时 抽检 。 用 ��� 际 行动 强化 现场 监管 ， 不断 深化 全体 剧组 人员 “ 涉枪 无 小事 ” 理念 ， 自觉 遵守 法律 规定 ， 确保 安全 无虞 ";
//		String res="原 标题 ： 无 人机 帮忙 打好 禁毒 攻坚战 <GPE>福建 龙岩 新罗区</GPE> 布下 天罗地网 有效 遏制 涉毒 犯罪 活动 资料 图 <ORG>新华社</ORG> <GPE>福州</GPE> <MISC>月日</MISC> 电 记者 <PERSON>巫奕龙</PERSON> <GPE>福建省</GPE> 禁毒 重点 “ 警示 地区 ” <MISC>之一</MISC> 的 <GPE>龙岩 新罗区</GPE> 群策 群力 禁毒 攻坚 布下 整治 涉麻 制毒 的 天罗地网 有效 遏制 了 涉毒 犯罪 活动 。 近年 来 新罗区 周边 涉麻 制毒 人员 流窜 ��区 内 一些 乡镇 利用 旧 养殖场 、 矿点 设立 制毒 窝点 生产 制作 冰毒 等 毒品 的 原材料 麻黄碱 。 区 禁毒办 常务 副主任 <PERSON>林洛波</PERSON> 介绍 说 <GPE>新罗区</GPE> 全力 “ 捣 窝点 追源头 ” 保持 禁毒 严打 的 高压 态势 <MISC>今年 月 至月</MISC> 共 查获 涉毒 刑事 案件 起 抓获 涉毒 犯罪 嫌疑人 人 查处 吸毒 人员 人次 缴获 各 类 毒品 <PERSON>克</PERSON> 、 麻黄素 公斤 实现 涉麻 制毒 被动 发现 窝点 “ 零发案 ” 。 新罗区 稳定 提升 区域 防控 的 力度 。 目前 全 区 共 安装 多 个 治安 监控 探头 个 镇 街 建立 了 个 网格 结合 出租 房屋 和 重点 场所 的 “ 二维码 ” 管理 技术 实现 统一 指挥 调度 、 部门 联勤 联动 、 情报 信息 共 享 做 到 车 过 留牌 、 人 过 留影 。 与此同时 购置 架 无 人机 对 山林 面积 大 、 废弃 猪圈 多 、 矿点 密集 的 山场 和 林地 进行 巡查 累计 巡查 面积 万 亩 清点 废弃 建筑 幢 、 重点 场所 逾 万处 辅以 人工 排查 确保 无 死角 。 <GPE>新罗区</GPE> 先后 成立 “ 北门 大 妈 ��� “ 咏春 反扒 ” “ <GPE>西城</GPE> 守护者 ” 等 多 支 志愿者 队伍 走街串巷 、 进村 入户 开展 日常 禁毒 巡查 和 宣传 。 <MISC>今年</MISC> 起 <GPE>白沙镇</GPE> 创造 性地 将 禁毒 工作 与 扶贫 攻坚 结合 起来 通过 严格 考核 管理 从 全 镇 贫困 户 中 招聘 名 专职 禁毒 巡查员 围绕 制毒 可疑 区域 开展 巡查 及时 发现 涉毒 线索 和 隐性 吸毒 人员 。 广泛 利用 各 种 平台 载体 加强 教育 引导 是 <LOC>新罗区</LOC> 强化 提升 禁毒 工作 的 又 一 重要 举措 。 <PERSON>林洛波</PERSON> 说 <LOC>新罗区</LOC> 依托 “ 在职 党员 进 <MISC>社区 ” “ 百</MISC> 名 干部 进 万 家 ” 等 平台 推动 禁毒 宣传 进 机关 、 进 学校 、 进 社区 、 进 企业 群众 对 禁毒 工作 的 知晓率 达 。 <LOC>小池 镇 山 美</LOC> 村 编排 龙岩 方言 快板 戏 《 打击 毒品 不 留情 》 受到 群众 欢迎 ； <ORG>镇 党委</ORG> 副书记 <PERSON>陈晶晶</PERSON> 说 “ 用 村民 听 得 懂 的 方言 、 快板 来 吸引 大家 现场 发放 禁毒 宣传 材料 村民 看 得 开 ";
		
//		int head=res.indexOf("湖州");
		
//		String res1 = res.substring(5, 12);
//		String time_array="Time1515382785970&1515382785970ID:5a52e8021b48eb508c097c76end	1515382211193&1515382211193ID:5a52e5c31b48eb50560410dcendLXQ";
//		
//		String create_time=time_array.substring(time_array.indexOf("Time"), time_array.indexOf("LXQ"));
////		 System.out.println(create_time);
//		System.out.println(create_time);
		String stri="文、图/广州日报全媒体记者 谢绮珊";

//		String stri4=stri.replaceAll("[\\pP\\p{Punct}]","").replaceAll("\\d+","");//清除所有符号,只留下字母 数字  汉字  共3类.  
//        System.out.println(stri4); 
		
		
		
		  String character = stri.replaceAll("[^(a-zA-Z0-9\\u4e00-\\u9fa5)]", "").replaceAll("[\\pP\\p{Punct}]","").replaceAll("\\d+","").replaceAll("#", "");
		  System.out.println(character);
		 
		 
	}}